'''
Написать функцию average для нахождения среднего значения коллекции.
Если длина коллекции 0, тогда необходимо напечатать сообщение об ошибке и вернуть None.
Пример 1
average([1, 2, 9])
Результат
3
Пример 2
average([])
Результат
Ошибка: была передана коллекция нулевой длины
'''

print([i  in sp for i in range(n)])