'''
Создать строку, развёрнув другую ('abc' -> 'cba')
'''

s = "abc"
s1 = s[::-1]
print(s1)