'''
Вывести все числа от n до 1 не включительно
'''
n = int(input("Сколько чисел? "))
for i in range(n-1, 0, -1):
    print(i)

